; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v5 - type_3 ?v8 - type_1)
 	      (pred_1 ?v1 - object ?v8 - type_1)
	      (pred_3 ?v5 - type_3 ?v4 - type_2)
	      (pred_2 ?v5 - type_3 ?v1 - object ?v4 - type_2))

   (:action op_1
       :parameters  (?v5 - type_3 ?v7 ?v2 - type_1)
       :precondition (and  (pred_4 ?v5 ?v7))
       :effect (and  (pred_4 ?v5 ?v2)
		     (not (pred_4 ?v5 ?v7))))

   (:action op_2
       :parameters (?v5 - type_3 ?v6 - object ?v3 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v3) (pred_4 ?v5 ?v3) (pred_3 ?v5 ?v4))
       :effect (and (pred_2 ?v5 ?v6 ?v4)
		    (not (pred_1 ?v6 ?v3)) 
		    (not (pred_3 ?v5 ?v4))))

   (:action op_3
       :parameters (?v5 - type_3 ?v6 - object ?v3 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v6 ?v4) (pred_4 ?v5 ?v3))
       :effect (and (pred_1 ?v6 ?v3)
		    (pred_3 ?v5 ?v4)
		    (not (pred_2 ?v5 ?v6 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_05 obj_06 - type_3
obj_08 obj_14 obj_09 obj_03 - type_2
obj_02 obj_12 obj_10 obj_01 - type_1
obj_11 obj_13 obj_04 obj_07 - object)
(:init
(pred_4 obj_05 obj_10)
(pred_3 obj_05 obj_08)
(pred_3 obj_05 obj_14)
(pred_4 obj_06 obj_01)
(pred_3 obj_06 obj_09)
(pred_3 obj_06 obj_03)
(pred_1 obj_11 obj_01)
(pred_1 obj_13 obj_10)
(pred_1 obj_04 obj_01)
(pred_1 obj_07 obj_01)
)
(:goal
(and
(pred_1 obj_11 obj_12)
(pred_1 obj_13 obj_10)
(pred_1 obj_04 obj_10)
(pred_1 obj_07 obj_12)
)
)

(:constraints
  (always (not (pred_4 obj_05 obj_01)))
)
)

; plan
1. (op_2 obj_06 obj_11 obj_01 obj_03)
   deleted: (pred_1 obj_11 obj_01) (pred_3 obj_06 obj_03)
   added: (pred_2 obj_06 obj_11 obj_03)
   goals met: 1 of 4
2. (op_2 obj_06 obj_07 obj_01 obj_09)
   deleted: (pred_1 obj_07 obj_01) (pred_3 obj_06 obj_09)
   added: (pred_2 obj_06 obj_07 obj_09)
   goals met: 1 of 4
3. (op_1 obj_06 obj_01 obj_12)
   deleted: (pred_4 obj_06 obj_01)
   added: (pred_4 obj_06 obj_12)
   goals met: 1 of 4
4. (op_3 obj_06 obj_07 obj_12 obj_09)
   deleted: (pred_2 obj_06 obj_07 obj_09)
   added: (pred_1 obj_07 obj_12) (pred_3 obj_06 obj_09)
   goals met: 2 of 4
5. (op_3 obj_06 obj_11 obj_12 obj_03)
   deleted: (pred_2 obj_06 obj_11 obj_03)
   added: (pred_1 obj_11 obj_12) (pred_3 obj_06 obj_03)
   goals met: 3 of 4
6. (op_1 obj_06 obj_12 obj_01)
   deleted: (pred_4 obj_06 obj_12)
   added: (pred_4 obj_06 obj_01)
   goals met: 3 of 4
7. (op_2 obj_06 obj_04 obj_01 obj_03)
   deleted: (pred_1 obj_04 obj_01) (pred_3 obj_06 obj_03)
   added: (pred_2 obj_06 obj_04 obj_03)
   goals met: 3 of 4
8. (op_1 obj_06 obj_01 obj_10)
   deleted: (pred_4 obj_06 obj_01)
   added: (pred_4 obj_06 obj_10)
   goals met: 3 of 4
9. (op_3 obj_06 obj_04 obj_10 obj_03)
   deleted: (pred_2 obj_06 obj_04 obj_03)
   added: (pred_1 obj_04 obj_10) (pred_3 obj_06 obj_03)
   goals met: 4 of 4
